# Brewfile - Install with `brew bundle`

# Taps (removed deprecated ones - they're included by default now)
tap "homebrew/cask-fonts"

# Terminal essentials
brew "tmux"              # Terminal multiplexer
brew "stow"              # Symlink manager for dotfiles
brew "autojump"          # Smart directory navigation
brew "neovim"            # Modern vim

# Development tools
brew "git"               # Version control
brew "gh"                # GitHub CLI
brew "node"              # Node.js
brew "python@3.12"       # Python 3.12
brew "ripgrep"           # Fast grep alternative
brew "fzf"               # Fuzzy finder
brew "bat"               # Better cat
brew "eza"               # Better ls (formerly exa)
brew "fd"                # Better find
brew "jq"                # JSON processor
brew "tree"              # Directory tree viewer

# Fonts
cask "font-inconsolata-nerd-font"

# Applications
cask "hyper"             # Terminal emulator